HAMES2-1st-3/TunnelComfortSystemTesting/include/tc39xa/IfxCbs_regdef.h
/**
 * \file IfxCbs_regdef.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 *
 * Date: 2015-12-17 16:16:00 GMT
 * Version: TBD
 * Specification: TBD
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Cbs_Registers CbsRegisters
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Cbs_Registers_Bitfields Bitfields
 * \ingroup IfxLld_Cbs_Registers
 * 
 * \defgroup IfxLld_Cbs_Registers_union Register unions
 * \ingroup IfxLld_Cbs_Registers
 * 
 * \defgroup IfxLld_Cbs_Registers_struct Memory map
 * \ingroup IfxLld_Cbs_Registers
 */
#ifndef IFXCBS_REGDEF_H
#define IFXCBS_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Cbs_Bitfields
 * \{  */
/** \brief Communication Mode Data Register */
typedef struct _Ifx_CBS_COMDATA_Bits
{
    Ifx_UReg_32Bit DATA:32;           /**< \brief [31:0] Read/Write Data - DATA (rw) */
} Ifx_CBS_COMDATA_Bits;

/** \brief Internally Controlled Trace Source Register */
typedef struct _Ifx_CBS_ICTSA_Bits
{
    Ifx_UReg_32Bit ADDR:32;           /**< \brief [31:0] Source Address - ADDR (rw) */
} Ifx_CBS_ICTSA_Bits;

/** \brief Internally Controlled Trace Destination Register */
typedef struct _Ifx_CBS_ICTTA_Bits
{
    Ifx_UReg_32Bit ADDR:32;           /**< \brief [31:0] Destination Address - ADDR (rw) */
} Ifx_CBS_ICTTA_Bits;


/** \brief Internal Mode Status and Control Register */
typedef struct _Ifx_CBS_INTMOD_Bits
{
    Ifx_UReg_32Bit SET_CRS:1;         /**< \brief [0:0] Set Read Sync Flag - SET_CRS (w) */
    Ifx_UReg_32Bit SET_CWS:1;         /**< \brief [1:1] Set Write Sync Flag - SET_CWS (w) */
    Ifx_UReg_32Bit SET_CS:1;          /**< \brief [2:2] Set Communication Synchronization Flag - SET_CS (w) */
    Ifx_UReg_32Bit CLR_CS:1;          /**< \brief [3:3] Clear Communication Synchronization Flag - CLR_CS (w) */
    Ifx_UReg_32Bit CHANNEL_P:1;       /**< \brief [4:4] CHANNEL Write Protection - CHANNEL_P (w) */
    Ifx_UReg_32Bit CHANNEL:3;         /**< \brief [7:5] Channel Indication - CHANNEL (rw) */
    Ifx_UReg_32Bit reserved_8:8;      /**< \brief [15:8] \internal Reserved */
    Ifx_UReg_32Bit SET_INT_MOD:1;     /**< \brief [16:16] Enter Internal Mode - SET_INT_MOD (w) */
    Ifx_UReg_32Bit reserved_17:1;     /**< \brief [17:17] \internal Reserved */
    Ifx_UReg_32Bit SET_INT_TRC:1;     /**< \brief [18:18] Enable Internally Controlled Triggered Transfer - SET_INT_TRC (w) */
    Ifx_UReg_32Bit CLR_INT_TRC:1;     /**< \brief [19:19] Disable Internally Controlled Triggered Transfer - CLR_INT_TRC (w) */
    Ifx_UReg_32Bit TRC_MOD_P:1;       /**< \brief [20:20] TRC_MOD Write Protection - TRC_MOD_P (w) */
    Ifx_UReg_32Bit TRC_MOD:2;         /**< \brief [22:21] Data Size Definition for Triggered Transfer - TRC_MOD (rw) */
    Ifx_UReg_32Bit reserved_23:1;     /**< \brief [23:23] \internal Reserved */
    Ifx_UReg_32Bit INT_MOD:1;         /**< \brief [24:24] Internal Mode Enabled Flag - INT_MOD (rh) */
    Ifx_UReg_32Bit INT_TRC:1;         /**< \brief [25:25] Internally Controlled Triggered Transfer Enable - INT_TRC (rh) */
    Ifx_UReg_32Bit reserved_26:6;     /**< \brief [31:26] \internal Reserved */
} Ifx_CBS_INTMOD_Bits;

/** \brief ${CBS_ioclient_name}Status and Control Register */
typedef struct _Ifx_CBS_IOSR_Bits
{
    Ifx_UReg_32Bit reserved_0:4;      /**< \brief [3:0] \internal Reserved */
    Ifx_UReg_32Bit CRSYNC:1;          /**< \brief [4:4] Communication Mode Read Sync Flag - CRSYNC (rh) */
    Ifx_UReg_32Bit CWSYNC:1;          /**< \brief [5:5] Communication Mode Write Sync Flag - CWSYNC (rh) */
    Ifx_UReg_32Bit CW_ACK:1;          /**< \brief [6:6] Communication Mode Write Acknowledge - CW_ACK (w) */
    Ifx_UReg_32Bit COM_SYNC:1;        /**< \brief [7:7] Communication Mode Synchronization Flag - COM_SYNC (rh) */
    Ifx_UReg_32Bit HOSTED:1;          /**< \brief [8:8] Tool Interface in Use - HOSTED (rh) */
    Ifx_UReg_32Bit reserved_9:3;      /**< \brief [11:9] \internal Reserved */
    Ifx_UReg_32Bit CHANNEL:3;         /**< \brief [14:12] Channel Indication - CHANNEL (rh) */
    Ifx_UReg_32Bit reserved_15:17;    /**< \brief [31:15] \internal Reserved */
} Ifx_CBS_IOSR_Bits;

/** \brief Module Identification Register */
typedef struct _Ifx_CBS_JDPID_Bits
{
    Ifx_UReg_32Bit MOD_REV:8;         /**< \brief [7:0] Module Revision - MOD_REV (r) */
    Ifx_UReg_32Bit MOD_TYPE:8;        /**< \brief [15:8] Module Type - MOD_TYPE (r) */
    Ifx_UReg_32Bit MOD_NUMBER:16;     /**< \brief [31:16] Module Number - MOD_NUMBER (r) */
} Ifx_CBS_JDPID_Bits;

/** \brief ${CBS_jtag_name}Device Identification Register */
typedef struct _Ifx_CBS_JTAGID_Bits
{
    Ifx_UReg_32Bit JTAG_ID:32;        /**< \brief [31:0] ${CBS_jtag_name}Device ID - JTAG_ID (rw) */
} Ifx_CBS_JTAGID_Bits;

/** \brief ${OSCU_Name}Control Register */
typedef struct _Ifx_CBS_OCNTRL_Bits
{
    Ifx_UReg_32Bit OC_P0:1;           /**< \brief [0:0] OC${x} Write Protection - OC${x}_P (w) */
    Ifx_UReg_32Bit OC0:1;             /**< \brief [1:1] Set/Clear OCDS Control Bits Bus Domain - OC${x} (w) */
    Ifx_UReg_32Bit OC_P1:1;           /**< \brief [2:2] OC${x} Write Protection - OC${x}_P (w) */
    Ifx_UReg_32Bit OC1:1;             /**< \brief [3:3] Set/Clear OCDS Control Bits Bus Domain - OC${x} (w) */
    Ifx_UReg_32Bit OC_P2:1;           /**< \brief [4:4] OC${x} Write Protection - OC${x}_P (w) */
    Ifx_UReg_32Bit OC2:1;             /**< \brief [5:5] Set/Clear OCDS Control Bits Bus Domain - OC${x} (w) */
    Ifx_UReg_32Bit OC_P3:1;           /**< \brief [6:6] OC${x} Write Protection - OC${x}_P (w) */
    Ifx_UReg_32Bit OC3:1;             /**< \brief [7:7] Set/Clear OCDS Control Bits Bus Domain - OC${x} (w) */
    Ifx_UReg_32Bit OC_P4:1;           /**< \brief [8:8] OC${x} Write Protection - OC${x}_P (w) */
    Ifx_UReg_32Bit OC4:1;             /**< \brief [9:9] Set/Clear OCDS Control Bits Bus Domain - OC${x} (w) */
    Ifx_UReg_32Bit OC_P5:1;           /**< \brief [10:10] OC${x} Write Protection - OC${x}_P (w) */
    Ifx_UReg_32Bit OC5:1;             /**< \brief [11:11] Set/Clear OCDS Control Bits Bus Domain - OC${x} (w) */
    Ifx_UReg_32Bit WDTSUS_P:1;        /**< \brief [12:12] WDTSUS Write Protection - WDTSUS_P (w) */
    Ifx_UReg_32Bit WDTSUS:1;          /**< \brief [13:13] Set/Clear Watchdog Timer Suspension Control - WDTSUS (w) */
    Ifx_UReg_32Bit STABLE_P:1;        /**< \brief [14:14] STABLE Write Protection - STABLE_P (w) */
    Ifx_UReg_32Bit STABLE:1;          /**< \brief [15:15] Initialize${Application_Reset}Indication - STABLE (w) */
    Ifx_UReg_32Bit OJC_P0:1;          /**< \brief [16:16] OJC${x} Write Protection - OJC${x}_P (w) */
    Ifx_UReg_32Bit OJC0:1;            /**< \brief [17:17] Set/Clear OCDS Control Bits IOClient Domain - OJC${x} (w) */
    Ifx_UReg_32Bit OJC_P1:1;          /**< \brief [18:18] OJC${x} Write Protection - OJC${x}_P (w) */
    Ifx_UReg_32Bit OJC1:1;            /**< \brief [19:19] Set/Clear OCDS Control Bits IOClient Domain - OJC${x} (w) */
    Ifx_UReg_32Bit OJC_P2:1;          /**< \brief [20:20] OJC${x} Write Protection - OJC${x}_P (w) */
    Ifx_UReg_32Bit OJC2:1;            /**< \brief [21:21] Set/Clear OCDS Control Bits IOClient Domain - OJC${x} (w) */
    Ifx_UReg_32Bit OJC_P3:1;          /**< \brief [22:22] OJC${x} Write Protection - OJC${x}_P (w) */
    Ifx_UReg_32Bit OJC3:1;            /**< \brief [23:23] Set/Clear OCDS Control Bits IOClient Domain - OJC${x} (w) */
    Ifx_UReg_32Bit OJC_P4:1;          /**< \brief [24:24] OJC${x} Write Protection - OJC${x}_P (w) */
    Ifx_UReg_32Bit OJC4:1;            /**< \brief [25:25] Set/Clear OCDS Control Bits IOClient Domain - OJC${x} (w) */
    Ifx_UReg_32Bit OJC_P5:1;          /**< \brief [26:26] OJC${x} Write Protection - OJC${x}_P (w) */
    Ifx_UReg_32Bit OJC5:1;            /**< \brief [27:27] Set/Clear OCDS Control Bits IOClient Domain - OJC${x} (w) */
    Ifx_UReg_32Bit OJC_P6:1;          /**< \brief [28:28] OJC${x} Write Protection - OJC${x}_P (w) */
    Ifx_UReg_32Bit OJC6:1;            /**< \brief [29:29] Set/Clear OCDS Control Bits IOClient Domain - OJC${x} (w) */
    Ifx_UReg_32Bit OJC_P7:1;          /**< \brief [30:30] OJC${x} Write Protection - OJC${x}_P (w) */
    Ifx_UReg_32Bit OJC7:1;            /**< \brief [31:31] Set/Clear OCDS Control Bits IOClient Domain - OJC${x} (w) */
} Ifx_CBS_OCNTRL_Bits;

/** \brief OCDS Enable Control Register */
typedef struct _Ifx_CBS_OEC_Bits
{
    Ifx_UReg_32Bit PAT:8;             /**< \brief [7:0] OCDS Enabling Pattern - PAT (w) */
    Ifx_UReg_32Bit DS:1;              /**< \brief [8:8] Disable OCDS - DS (w) */
    Ifx_UReg_32Bit OCO:1;             /**< \brief [9:9] OCDS Clock Off - OCO (w) */
    Ifx_UReg_32Bit reserved_10:6;     /**< \brief [15:10] \internal Reserved */
    Ifx_UReg_32Bit IF_LCK_P:1;        /**< \brief [16:16] IF_LCK Write Protection - IF_LCK_P (w) */
    Ifx_UReg_32Bit IF_LCK:1;          /**< \brief [17:17] Set/Clear Interface Locked Indication - IF_LCK (w) */
    Ifx_UReg_32Bit AUT_OK_P:1;        /**< \brief [18:18] AUT_OK Write Protection - AUT_OK_P (w) */
    Ifx_UReg_32Bit AUT_OK:1;          /**< \brief [19:19] Set/Clear the Authorization OK Indication - AUT_OK (w) */
    Ifx_UReg_32Bit reserved_20:12;    /**< \brief [31:20] \internal Reserved */
} Ifx_CBS_OEC_Bits;

