HAMES2-1st-3/TunnelComfortSystemTesting/include/tc39xa/IfxCbs_regdef.h
/** \brief TG Capture for OTGB0/1 */
typedef struct _Ifx_CBS_TCTGB_Bits
{
    Ifx_UReg_32Bit OTGB0:16;          /**< \brief [15:0] Capture Bits for OTGB0 - OTGB0 (rh) */
    Ifx_UReg_32Bit OTGB1:16;          /**< \brief [31:16] Capture Bits for OTGB1 - OTGB1 (rh) */
} Ifx_CBS_TCTGB_Bits;

/** \brief TG Capture for TG Lines */
typedef struct _Ifx_CBS_TCTL_Bits
{
    Ifx_UReg_32Bit reserved_0:1;      /**< \brief [0:0] \internal Reserved */
    Ifx_UReg_32Bit TL1:1;             /**< \brief [1:1] Capture of Trigger Line ${x} - TL${x} (rh) */
    Ifx_UReg_32Bit TL2:1;             /**< \brief [2:2] Capture of Trigger Line ${x} - TL${x} (rh) */
    Ifx_UReg_32Bit TL3:1;             /**< \brief [3:3] Capture of Trigger Line ${x} - TL${x} (rh) */
    Ifx_UReg_32Bit TL4:1;             /**< \brief [4:4] Capture of Trigger Line ${x} - TL${x} (rh) */
    Ifx_UReg_32Bit TL5:1;             /**< \brief [5:5] Capture of Trigger Line ${x} - TL${x} (rh) */
    Ifx_UReg_32Bit TL6:1;             /**< \brief [6:6] Capture of Trigger Line ${x} - TL${x} (rh) */
    Ifx_UReg_32Bit TL7:1;             /**< \brief [7:7] Capture of Trigger Line ${x} - TL${x} (rh) */
    Ifx_UReg_32Bit reserved_8:24;     /**< \brief [31:8] \internal Reserved */
} Ifx_CBS_TCTL_Bits;

/** \brief TG Input Pins Routing */
typedef struct _Ifx_CBS_TIPR_Bits
{
    Ifx_UReg_32Bit PIN0:4;            /**< \brief [3:0] Trigger Pin ${x} to Trigger Line Routing - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN1:4;            /**< \brief [7:4] Trigger Pin ${x} to Trigger Line Routing - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN2:4;            /**< \brief [11:8] Trigger Pin ${x} to Trigger Line Routing - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN3:4;            /**< \brief [15:12] Trigger Pin ${x} to Trigger Line Routing - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN4:4;            /**< \brief [19:16] Trigger Pin ${x} to Trigger Line Routing - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN5:4;            /**< \brief [23:20] Trigger Pin ${x} to Trigger Line Routing - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN6:4;            /**< \brief [27:24] Trigger Pin ${x} to Trigger Line Routing - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN7:4;            /**< \brief [31:28] Trigger Pin ${x} to Trigger Line Routing - PIN${x} (rw) */
} Ifx_CBS_TIPR_Bits;

/** \brief TG Line 1 Suspend Targets */
typedef struct _Ifx_CBS_TL1ST_Bits
{
    Ifx_UReg_32Bit C0:1;              /**< \brief [0:0] CPU${x} as Suspend Target - C${x} (rw) */
    Ifx_UReg_32Bit C1:1;              /**< \brief [1:1] CPU${x} as Suspend Target - C${x} (rw) */
    Ifx_UReg_32Bit C2:1;              /**< \brief [2:2] CPU${x} as Suspend Target - C${x} (rw) */
    Ifx_UReg_32Bit C3:1;              /**< \brief [3:3] CPU${x} as Suspend Target - C${x} (rw) */
    Ifx_UReg_32Bit C4:1;              /**< \brief [4:4] CPU${x} as Suspend Target - C${x} (rw) */
    Ifx_UReg_32Bit C5:1;              /**< \brief [5:5] CPU${x} as Suspend Target - C${x} (rw) */
    Ifx_UReg_32Bit reserved_6:18;     /**< \brief [23:6] \internal Reserved */
    Ifx_UReg_32Bit M0M1M2M31:1;       /**< \brief [24:24] Master X as Suspend Target - M0M1M2M3 (rw) */
    Ifx_UReg_32Bit M0M1M2M32:1;       /**< \brief [25:25] Master X as Suspend Target - M0M1M2M3 (rw) */
    Ifx_UReg_32Bit M0M1M2M33:1;       /**< \brief [26:26] Master X as Suspend Target - M0M1M2M3 (rw) */
    Ifx_UReg_32Bit M0M1M2M34:1;       /**< \brief [27:27] Master X as Suspend Target - M0M1M2M3 (rw) */
    Ifx_UReg_32Bit HSS:1;             /**< \brief [28:28] HSSL as Suspend Target - HSS (rw) */
    Ifx_UReg_32Bit DMA:1;             /**< \brief [29:29] DMA as Suspend Target - DMA (rw) */
    Ifx_UReg_32Bit reserved_30:1;     /**< \brief [30:30] \internal Reserved */
    Ifx_UReg_32Bit HSM:1;             /**< \brief [31:31] ${CBS_hsm_name}as Suspend Target - HSM (rw) */
} Ifx_CBS_TL1ST_Bits;

/** \brief TG Line Control */
typedef struct _Ifx_CBS_TLC_Bits
{
    Ifx_UReg_32Bit reserved_0:4;      /**< \brief [3:0] \internal Reserved */
    Ifx_UReg_32Bit TLSP1:4;           /**< \brief [7:4] TG Line Signal Processing - TLSP${x} (rw) */
    Ifx_UReg_32Bit TLSP2:4;           /**< \brief [11:8] TG Line Signal Processing - TLSP${x} (rw) */
    Ifx_UReg_32Bit TLSP3:4;           /**< \brief [15:12] TG Line Signal Processing - TLSP${x} (rw) */
    Ifx_UReg_32Bit TLSP4:4;           /**< \brief [19:16] TG Line Signal Processing - TLSP${x} (rw) */
    Ifx_UReg_32Bit TLSP5:4;           /**< \brief [23:20] TG Line Signal Processing - TLSP${x} (rw) */
    Ifx_UReg_32Bit TLSP6:4;           /**< \brief [27:24] TG Line Signal Processing - TLSP${x} (rw) */
    Ifx_UReg_32Bit TLSP7:4;           /**< \brief [31:28] TG Line Signal Processing - TLSP${x} (rw) */
} Ifx_CBS_TLC_Bits;

/** \brief TG Line Counter Control */
typedef struct _Ifx_CBS_TLCC_Bits
{
    Ifx_UReg_32Bit TGL:4;             /**< \brief [3:0] Trigger Line to Counter Routing - TGL (rw) */
    Ifx_UReg_32Bit LE:3;              /**< \brief [6:4] Level or Edge Counting - LE (rw) */
    Ifx_UReg_32Bit reserved_7:1;      /**< \brief [7:7] \internal Reserved */
    Ifx_UReg_32Bit CLR:2;             /**< \brief [9:8] Clear and Enable Counter(s) - CLR (w) */
    Ifx_UReg_32Bit reserved_10:2;     /**< \brief [11:10] \internal Reserved */
    Ifx_UReg_32Bit STOP:2;            /**< \brief [13:12] Stop Counter(s) - STOP (w) */
    Ifx_UReg_32Bit reserved_14:18;    /**< \brief [31:14] \internal Reserved */
} Ifx_CBS_TLCC_Bits;

/** \brief TG Line Capture and Hold Enable */
typedef struct _Ifx_CBS_TLCHE_Bits
{
    Ifx_UReg_32Bit reserved_0:1;      /**< \brief [0:0] \internal Reserved */
    Ifx_UReg_32Bit TL1:1;             /**< \brief [1:1] Capture and Hold Enable for Trigger Line ${x} - TL${x} (rw) */
    Ifx_UReg_32Bit TL2:1;             /**< \brief [2:2] Capture and Hold Enable for Trigger Line ${x} - TL${x} (rw) */
    Ifx_UReg_32Bit TL3:1;             /**< \brief [3:3] Capture and Hold Enable for Trigger Line ${x} - TL${x} (rw) */
    Ifx_UReg_32Bit reserved_4:28;     /**< \brief [31:4] \internal Reserved */
} Ifx_CBS_TLCHE_Bits;

/** \brief TG Line Capture and Hold Clear */
typedef struct _Ifx_CBS_TLCHS_Bits
{
    Ifx_UReg_32Bit reserved_0:1;      /**< \brief [0:0] \internal Reserved */
    Ifx_UReg_32Bit TL1:1;             /**< \brief [1:1] Capture and Hold Clear for Trigger Line ${x} - TL${x} (w) */
    Ifx_UReg_32Bit TL2:1;             /**< \brief [2:2] Capture and Hold Clear for Trigger Line ${x} - TL${x} (w) */
    Ifx_UReg_32Bit TL3:1;             /**< \brief [3:3] Capture and Hold Clear for Trigger Line ${x} - TL${x} (w) */
    Ifx_UReg_32Bit reserved_4:28;     /**< \brief [31:4] \internal Reserved */
} Ifx_CBS_TLCHS_Bits;

/** \brief TG Line Counter Value */
typedef struct _Ifx_CBS_TLCV_Bits
{
    Ifx_UReg_32Bit CV:31;             /**< \brief [30:0] Count Value - CV (rh) */
    Ifx_UReg_32Bit SO:1;              /**< \brief [31:31] Sticky Overflow Bit - SO (rh) */
} Ifx_CBS_TLCV_Bits;

/** \brief TG Line State */
typedef struct _Ifx_CBS_TLS_Bits
{
    Ifx_UReg_32Bit reserved_0:1;      /**< \brief [0:0] \internal Reserved */
    Ifx_UReg_32Bit TL1:1;             /**< \brief [1:1] Current State of Trigger Line ${x} - TL${x} (rh) */
    Ifx_UReg_32Bit TL2:1;             /**< \brief [2:2] Current State of Trigger Line ${x} - TL${x} (rh) */
    Ifx_UReg_32Bit TL3:1;             /**< \brief [3:3] Current State of Trigger Line ${x} - TL${x} (rh) */
    Ifx_UReg_32Bit TL4:1;             /**< \brief [4:4] Current State of Trigger Line ${x} - TL${x} (rh) */
    Ifx_UReg_32Bit TL5:1;             /**< \brief [5:5] Current State of Trigger Line ${x} - TL${x} (rh) */
    Ifx_UReg_32Bit TL6:1;             /**< \brief [6:6] Current State of Trigger Line ${x} - TL${x} (rh) */
    Ifx_UReg_32Bit TL7:1;             /**< \brief [7:7] Current State of Trigger Line ${x} - TL${x} (rh) */
    Ifx_UReg_32Bit reserved_8:24;     /**< \brief [31:8] \internal Reserved */
} Ifx_CBS_TLS_Bits;

/** \brief TG Line Timer */
typedef struct _Ifx_CBS_TLT_Bits
{
    Ifx_UReg_32Bit TGL:4;             /**< \brief [3:0] Timer to Trigger Line Routing - TGL (rw) */
    Ifx_UReg_32Bit VTZ:1;             /**< \brief [4:4] TG Line Value when Timer Value is Zero - VTZ (rw) */
    Ifx_UReg_32Bit RL:1;              /**< \brief [5:5] Reload Timer - RL (rw) */
    Ifx_UReg_32Bit reserved_6:10;     /**< \brief [15:6] \internal Reserved */
    Ifx_UReg_32Bit TIM:16;            /**< \brief [31:16] Timer Value - TIM (rwh) */
} Ifx_CBS_TLT_Bits;

/** \brief TG Lines for Trigger to Host */
typedef struct _Ifx_CBS_TLTTH_Bits
{
    Ifx_UReg_32Bit reserved_0:2;      /**< \brief [1:0] \internal Reserved */
    Ifx_UReg_32Bit TL1:2;             /**< \brief [3:2] TG Line Enabling for Trigger to Host (TRIG) - TL${x} (rw) */
    Ifx_UReg_32Bit TL2:2;             /**< \brief [5:4] TG Line Enabling for Trigger to Host (TRIG) - TL${x} (rw) */
    Ifx_UReg_32Bit TL3:2;             /**< \brief [7:6] TG Line Enabling for Trigger to Host (TRIG) - TL${x} (rw) */
    Ifx_UReg_32Bit TL4:2;             /**< \brief [9:8] TG Line Enabling for Trigger to Host (TRIG) - TL${x} (rw) */
    Ifx_UReg_32Bit TL5:2;             /**< \brief [11:10] TG Line Enabling for Trigger to Host (TRIG) - TL${x} (rw) */
    Ifx_UReg_32Bit TL6:2;             /**< \brief [13:12] TG Line Enabling for Trigger to Host (TRIG) - TL${x} (rw) */
    Ifx_UReg_32Bit TL7:2;             /**< \brief [15:14] TG Line Enabling for Trigger to Host (TRIG) - TL${x} (rw) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_CBS_TLTTH_Bits;

