HAMES2-1st-3/TunnelComfortSystemTesting/include/tc39xa/IfxCbs_regdef.h
/** \brief TG Output Pins Pulse Stretcher */
typedef struct _Ifx_CBS_TOPPS_Bits
{
    Ifx_UReg_32Bit PIN0:2;            /**< \brief [1:0] Pulse Stretch Control for Trigger Pin ${x} - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN1:2;            /**< \brief [3:2] Pulse Stretch Control for Trigger Pin ${x} - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN2:2;            /**< \brief [5:4] Pulse Stretch Control for Trigger Pin ${x} - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN3:2;            /**< \brief [7:6] Pulse Stretch Control for Trigger Pin ${x} - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN4:2;            /**< \brief [9:8] Pulse Stretch Control for Trigger Pin ${x} - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN5:2;            /**< \brief [11:10] Pulse Stretch Control for Trigger Pin ${x} - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN6:2;            /**< \brief [13:12] Pulse Stretch Control for Trigger Pin ${x} - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN7:2;            /**< \brief [15:14] Pulse Stretch Control for Trigger Pin ${x} - PIN${x} (rw) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_CBS_TOPPS_Bits;

/** \brief TG Output Pins Routing */
typedef struct _Ifx_CBS_TOPR_Bits
{
    Ifx_UReg_32Bit PIN0:4;            /**< \brief [3:0] Trigger Line to Trigger Pin ${x} Routing - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN1:4;            /**< \brief [7:4] Trigger Line to Trigger Pin ${x} Routing - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN2:4;            /**< \brief [11:8] Trigger Line to Trigger Pin ${x} Routing - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN3:4;            /**< \brief [15:12] Trigger Line to Trigger Pin ${x} Routing - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN4:4;            /**< \brief [19:16] Trigger Line to Trigger Pin ${x} Routing - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN5:4;            /**< \brief [23:20] Trigger Line to Trigger Pin ${x} Routing - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN6:4;            /**< \brief [27:24] Trigger Line to Trigger Pin ${x} Routing - PIN${x} (rw) */
    Ifx_UReg_32Bit PIN7:4;            /**< \brief [31:28] Trigger Line to Trigger Pin ${x} Routing - PIN${x} (rw) */
} Ifx_CBS_TOPR_Bits;

/** \brief TG Routing for CPU${x} */
typedef struct _Ifx_CBS_TRC_Bits
{
    Ifx_UReg_32Bit HALT:4;            /**< \brief [3:0] HALT to Trigger Line Routing - HALT (rw) */
    Ifx_UReg_32Bit BRKOUT:4;          /**< \brief [7:4] BRKOUT to Trigger Line Routing - BRKOUT (rw) */
    Ifx_UReg_32Bit BT1:1;             /**< \brief [8:8] BRKOUT to Trigger Line 1 Routing - BT1 (rw) */
    Ifx_UReg_32Bit reserved_9:11;     /**< \brief [19:9] \internal Reserved */
    Ifx_UReg_32Bit BRKIN:4;           /**< \brief [23:20] Trigger Line to BRKIN Routing - BRKIN (rw) */
    Ifx_UReg_32Bit SUSIN:4;           /**< \brief [27:24] Trigger Line to SUSIN Routing - SUSIN (rw) */
    Ifx_UReg_32Bit reserved_28:4;     /**< \brief [31:28] \internal Reserved */
} Ifx_CBS_TRC_Bits;

/** \brief TG Routing Events of CPU${x} */
typedef struct _Ifx_CBS_TREC_Bits
{
    Ifx_UReg_32Bit TR0EV:4;           /**< \brief [3:0] TRxEVT to Trigger Line Routing - TR0EV,TR2EV,TR4EV,TR6EV (rw) */
    Ifx_UReg_32Bit reserved_4:4;      /**< \brief [7:4] \internal Reserved */
    Ifx_UReg_32Bit TR2EV:4;           /**< \brief [11:8] TRxEVT to Trigger Line Routing - TR0EV,TR2EV,TR4EV,TR6EV (rw) */
    Ifx_UReg_32Bit reserved_12:4;     /**< \brief [15:12] \internal Reserved */
    Ifx_UReg_32Bit TR4EV:4;           /**< \brief [19:16] TRxEVT to Trigger Line Routing - TR0EV,TR2EV,TR4EV,TR6EV (rw) */
    Ifx_UReg_32Bit reserved_20:4;     /**< \brief [23:20] \internal Reserved */
    Ifx_UReg_32Bit TR6EV:4;           /**< \brief [27:24] TRxEVT to Trigger Line Routing - TR0EV,TR2EV,TR4EV,TR6EV (rw) */
    Ifx_UReg_32Bit reserved_28:4;     /**< \brief [31:28] \internal Reserved */
} Ifx_CBS_TREC_Bits;

/** \brief TG Routing for${CBS_hsm_name}Control */
typedef struct _Ifx_CBS_TRHSM_Bits
{
    Ifx_UReg_32Bit HALT:4;            /**< \brief [3:0] HALT to Trigger Line Routing - HALT (rw) */
    Ifx_UReg_32Bit BRKOUT:4;          /**< \brief [7:4] BRKOUT to Trigger Line Routing - BRKOUT (rw) */
    Ifx_UReg_32Bit BT1:1;             /**< \brief [8:8] BRKOUT to Trigger Line 1 Routing - BT1 (rw) */
    Ifx_UReg_32Bit reserved_9:11;     /**< \brief [19:9] \internal Reserved */
    Ifx_UReg_32Bit BRKIN:4;           /**< \brief [23:20] Trigger Line to BRKIN Routing - BRKIN (rw) */
    Ifx_UReg_32Bit SUSIN:4;           /**< \brief [27:24] Trigger Line to SUSIN Routing - SUSIN (rw) */
    Ifx_UReg_32Bit reserved_28:4;     /**< \brief [31:28] \internal Reserved */
} Ifx_CBS_TRHSM_Bits;

/** \brief Trigger to Host Register ${x} */
typedef struct _Ifx_CBS_TRIG_Bits
{
    Ifx_UReg_32Bit TRGX0:1;           /**< \brief [0:0] Service Request Bits - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX1:1;           /**< \brief [1:1] Service Request Bits - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX2:1;           /**< \brief [2:2] Service Request Bits - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX3:1;           /**< \brief [3:3] Service Request Bits - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX4:1;           /**< \brief [4:4] Service Request Bits - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX5:1;           /**< \brief [5:5] Service Request Bits - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX6:1;           /**< \brief [6:6] Service Request Bits - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX7:1;           /**< \brief [7:7] Service Request Bits - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX8:1;           /**< \brief [8:8] Service Request Bits - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX9:1;           /**< \brief [9:9] Service Request Bits - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX10:1;          /**< \brief [10:10] Service Request Bits - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX11:1;          /**< \brief [11:11] Service Request Bits - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX12:1;          /**< \brief [12:12] Service Request Bits - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX13:1;          /**< \brief [13:13] Service Request Bits - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX14:1;          /**< \brief [14:14] Service Request Bits - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX15:1;          /**< \brief [15:15] Service Request Bits - TRGx_${y} (rh) */
    Ifx_UReg_32Bit reserved_16:8;     /**< \brief [23:16] \internal Reserved */
    Ifx_UReg_32Bit X:8;               /**< \brief [31:24] TRIG register number - x (rh) */
} Ifx_CBS_TRIG_Bits;

/** \brief Clear Trigger to Host Register */
typedef struct _Ifx_CBS_TRIGC_Bits
{
    Ifx_UReg_32Bit TRGX0:1;           /**< \brief [0:0] Request Bits of most important register TRIGx - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX1:1;           /**< \brief [1:1] Request Bits of most important register TRIGx - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX2:1;           /**< \brief [2:2] Request Bits of most important register TRIGx - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX3:1;           /**< \brief [3:3] Request Bits of most important register TRIGx - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX4:1;           /**< \brief [4:4] Request Bits of most important register TRIGx - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX5:1;           /**< \brief [5:5] Request Bits of most important register TRIGx - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX6:1;           /**< \brief [6:6] Request Bits of most important register TRIGx - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX7:1;           /**< \brief [7:7] Request Bits of most important register TRIGx - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX8:1;           /**< \brief [8:8] Request Bits of most important register TRIGx - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX9:1;           /**< \brief [9:9] Request Bits of most important register TRIGx - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX10:1;          /**< \brief [10:10] Request Bits of most important register TRIGx - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX11:1;          /**< \brief [11:11] Request Bits of most important register TRIGx - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX12:1;          /**< \brief [12:12] Request Bits of most important register TRIGx - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX13:1;          /**< \brief [13:13] Request Bits of most important register TRIGx - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX14:1;          /**< \brief [14:14] Request Bits of most important register TRIGx - TRGx_${y} (rh) */
    Ifx_UReg_32Bit TRGX15:1;          /**< \brief [15:15] Request Bits of most important register TRIGx - TRGx_${y} (rh) */
    Ifx_UReg_32Bit reserved_16:8;     /**< \brief [23:16] \internal Reserved */
    Ifx_UReg_32Bit X:8;               /**< \brief [31:24] Index of most important register TRIGx - x (rh) */
} Ifx_CBS_TRIGC_Bits;

/** \brief Set Trigger to Host Register */
typedef struct _Ifx_CBS_TRIGS_Bits
{
    Ifx_UReg_32Bit BITNUM:8;          /**< \brief [7:0] Service Request Bit Number to Set - BITNUM (w) */
    Ifx_UReg_32Bit reserved_8:24;     /**< \brief [31:8] \internal Reserved */
} Ifx_CBS_TRIGS_Bits;

