HAMES2-1st-3/TunnelComfortSystemTesting/include/tc39xa/IfxCbs_regdef.h
/** \brief TG Routing for MCDS Control */
typedef struct _Ifx_CBS_TRMC_Bits
{
    Ifx_UReg_32Bit reserved_0:4;      /**< \brief [3:0] \internal Reserved */
    Ifx_UReg_32Bit BRKOUT:4;          /**< \brief [7:4] MCDS break_out to Trigger Line Routing - BRKOUT (rw) */
    Ifx_UReg_32Bit SUSOUT:4;          /**< \brief [11:8] MCDS suspend_out to Trigger Line Routing - SUSOUT (rw) */
    Ifx_UReg_32Bit reserved_12:4;     /**< \brief [15:12] \internal Reserved */
    Ifx_UReg_32Bit reserved_16:4;     /**< \brief [19:16] \internal Reserved */
    Ifx_UReg_32Bit BRKIN:4;           /**< \brief [23:20] Trigger Line to MCDS break_in Routing - BRKIN (rw) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CBS_TRMC_Bits;

/** \brief TG Routing for MCDS Triggers */
typedef struct _Ifx_CBS_TRMT_Bits
{
    Ifx_UReg_32Bit TG0:4;             /**< \brief [3:0] MCDS trig_out ${x} to Trigger Line Routing - TG${x} (rw) */
    Ifx_UReg_32Bit TG1:4;             /**< \brief [7:4] MCDS trig_out ${x} to Trigger Line Routing - TG${x} (rw) */
    Ifx_UReg_32Bit TG2:4;             /**< \brief [11:8] MCDS trig_out ${x} to Trigger Line Routing - TG${x} (rw) */
    Ifx_UReg_32Bit TG3:4;             /**< \brief [15:12] MCDS trig_out ${x} to Trigger Line Routing - TG${x} (rw) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_CBS_TRMT_Bits;

/** \brief TG Routing for Special Signals */
typedef struct _Ifx_CBS_TRSS_Bits
{
    Ifx_UReg_32Bit TT:4;              /**< \brief [3:0] Trigger Line to Cerberus’ Triggered Transfer Routing - TT (rw) */
    Ifx_UReg_32Bit reserved_8:12;      /**< \brief [15:8] \internal Reserved */
    Ifx_UReg_32Bit SRC0:4;            /**< \brief [19:16] Trigger Line to SRC${x} Interrupt Routing - SRC${x} (rw) */
    Ifx_UReg_32Bit SRC1:4;            /**< \brief [23:20] Trigger Line to SRC${x} Interrupt Routing - SRC${x} (rw) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CBS_TRSS_Bits;

/** \brief TG Routing for OTGB0 Bits [15:8] */
typedef struct _Ifx_CBS_TRTGB_H_Bits
{
    Ifx_UReg_32Bit TG8:4;             /**< \brief [3:0] OTGB0 Bit ${x} to Trigger Line Routing - TG${x} (rw) */
    Ifx_UReg_32Bit TG9:4;             /**< \brief [7:4] OTGB0 Bit ${x} to Trigger Line Routing - TG${x} (rw) */
    Ifx_UReg_32Bit TG10:4;            /**< \brief [11:8] OTGB0 Bit ${x} to Trigger Line Routing - TG${x} (rw) */
    Ifx_UReg_32Bit TG11:4;            /**< \brief [15:12] OTGB0 Bit ${x} to Trigger Line Routing - TG${x} (rw) */
    Ifx_UReg_32Bit TG12:4;            /**< \brief [19:16] OTGB0 Bit ${x} to Trigger Line Routing - TG${x} (rw) */
    Ifx_UReg_32Bit TG13:4;            /**< \brief [23:20] OTGB0 Bit ${x} to Trigger Line Routing - TG${x} (rw) */
    Ifx_UReg_32Bit TG14:4;            /**< \brief [27:24] OTGB0 Bit ${x} to Trigger Line Routing - TG${x} (rw) */
    Ifx_UReg_32Bit TG15:4;            /**< \brief [31:28] OTGB0 Bit ${x} to Trigger Line Routing - TG${x} (rw) */
} Ifx_CBS_TRTGB_H_Bits;

/** \brief TG Routing for OTGB0 Bits [7:0] */
typedef struct _Ifx_CBS_TRTGB_L_Bits
{
    Ifx_UReg_32Bit TG0:4;             /**< \brief [3:0] OTGB0 Bit ${x} to Trigger Line Routing - TG${x} (rw) */
    Ifx_UReg_32Bit TG1:4;             /**< \brief [7:4] OTGB0 Bit ${x} to Trigger Line Routing - TG${x} (rw) */
    Ifx_UReg_32Bit TG2:4;             /**< \brief [11:8] OTGB0 Bit ${x} to Trigger Line Routing - TG${x} (rw) */
    Ifx_UReg_32Bit TG3:4;             /**< \brief [15:12] OTGB0 Bit ${x} to Trigger Line Routing - TG${x} (rw) */
    Ifx_UReg_32Bit TG4:4;             /**< \brief [19:16] OTGB0 Bit ${x} to Trigger Line Routing - TG${x} (rw) */
    Ifx_UReg_32Bit TG5:4;             /**< \brief [23:20] OTGB0 Bit ${x} to Trigger Line Routing - TG${x} (rw) */
    Ifx_UReg_32Bit TG6:4;             /**< \brief [27:24] OTGB0 Bit ${x} to Trigger Line Routing - TG${x} (rw) */
    Ifx_UReg_32Bit TG7:4;             /**< \brief [31:28] OTGB0 Bit ${x} to Trigger Line Routing - TG${x} (rw) */
} Ifx_CBS_TRTGB_L_Bits;

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_cbs_union
 * \{   */
/** \brief Communication Mode Data Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CBS_COMDATA_Bits B;           /**< \brief Bitfield access */
} Ifx_CBS_COMDATA;

/** \brief Internally Controlled Trace Source Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CBS_ICTSA_Bits B;             /**< \brief Bitfield access */
} Ifx_CBS_ICTSA;

/** \brief Internally Controlled Trace Destination Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CBS_ICTTA_Bits B;             /**< \brief Bitfield access */
} Ifx_CBS_ICTTA;

/** \brief Internal Mode Status and Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CBS_INTMOD_Bits B;            /**< \brief Bitfield access */
} Ifx_CBS_INTMOD;

/** \brief ${CBS_ioclient_name}Status and Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CBS_IOSR_Bits B;              /**< \brief Bitfield access */
} Ifx_CBS_IOSR;

/** \brief Module Identification Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CBS_JDPID_Bits B;             /**< \brief Bitfield access */
} Ifx_CBS_JDPID;

/** \brief ${CBS_jtag_name}Device Identification Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CBS_JTAGID_Bits B;            /**< \brief Bitfield access */
} Ifx_CBS_JTAGID;

